app/Helpers/common_helper.php

SELECT *
FROM `category`
WHERE `id` = '9'
---
    function category_name($category_id) {

        $db = \Config\Database::connect();

        $builder = $db->table('category');

        $result = $builder->where(['id' => $category_id])->get()->getRow();

SELECT *
FROM `unit`
WHERE `id` = '6'
---
    function unit_name($measure_id) {

        $db = \Config\Database::connect();

        $builder = $db->table('unit');

        $result = $builder->where(['id' => $measure_id])->get()->getRow();

SELECT *
FROM `users`
WHERE `id` = '1426'
---
    function get_user($user_id) {

        $db = \Config\Database::connect();

        $builder = $db->table('users');

        $result = $builder->where(['id' => $user_id])->get()->getRow();

SELECT COUNT(*) AS `numrows`
FROM `cart`
WHERE `user_id` = '1426'
---
    function get_total_carts($user_id, $user_ip) {

        $db = \Config\Database::connect();

        $builder = $db->table('cart');

        if($user_id != NULL){

            $result = $builder->where(['user_id' => $user_id])->countAllResults();

SELECT *
FROM `product_variant`
WHERE `id` = '107'
---
    function get_product_id_from_varient($varient_id) {

        $db = \Config\Database::connect();

        $builder = $db->table('product_variant');

        $result = $builder->where(['id' => $varient_id])->get()->getRow();

SELECT *
FROM `products`
WHERE `id` = '70'
---
    function get_product_name($product_id) {

        $db = \Config\Database::connect();

        $builder = $db->table('products');

        $result = $builder->where(['id' => $product_id])->get()->getRow();

SELECT *
FROM `products`
WHERE `id` = '70'
---
    function get_product_image($product_id) {

        $db = \Config\Database::connect();

        $builder = $db->table('products');

        $result = $builder->where(['id' => $product_id])->get()->getRow();

SELECT *
FROM `product_variant`
WHERE `id` = '107'
---
    function get_product_discounted_price($product_varient) {

        $db = \Config\Database::connect();

        $builder = $db->table('product_variant');

        $result = $builder->where(['id' => $product_varient])->get()->getRow();